{"records":[{"id":"1","name":"Yuvraj Singh","image":"https:\/\/upload.wikimedia.org\/wikipedia\/commons\/thumb\/8\/81\/Yuvraj_Singh_appointed_as_Ulysse_Nardin_watch_brand_ambassador.jpeg\/220px-Yuvraj_Singh_appointed_as_Ulysse_Nardin_watch_brand_ambassador.jpeg","total_score":"8804","description":"Yuvraj was born in a Punjabi Sikh family to Yograj Singh, a former India cricketer, and Shabnam Singh.[2] Tennis and roller skating were Yuvraj's favorite sports during his childhood and he was quite good at both. He had also won the National Under-14 Roller Skating Championship. His father threw away the medal and told him to forget skating and concentrate on cricket.[3] He would take Yuvraj to training every day.","matches_played":"133","country":"India"},{"id":"2","name":"Hashim Amla","image":"https:\/\/upload.wikimedia.org\/wikipedia\/commons\/thumb\/d\/d7\/Hashim_Amla.jpg\/220px-Hashim_Amla.jpg","total_score":"15393","description":"Hashim Muhammad Amla (born 31 March 1983) is a South African cricketer who plays for South Africa in all three formats of the game.[1] He is also a former captain of the Proteas and is a right-handed batsman[2] and occasional medium-pace bowler. He was South Africa's Test captain from June 2014 to January 2016.","matches_played":"205","country":"South Africa"},{"id":"3","name":"Muttiah Muralitharan","image":"https:\/\/upload.wikimedia.org\/wikipedia\/commons\/thumb\/c\/c6\/Photograph_of_Muttiah_Muralitharan.jpg\/220px-Photograph_of_Muttiah_Muralitharan.jpg","total_score":"2192","description":"Deshabandu Muttiah Muralitharan also spelt Muralidaran; born 17 April 1972) is a former Sri Lankan cricketer who was rated the greatest Test match bowler ever by Wisden Cricketers' Almanack in 2002. He retired from Test cricket in 2010, registering his 800th and final wicket on 22 July 2010 from his final ball in his last Test match.Muralitharan holds the world record for the most wickets in both test and one-day cricket.","matches_played":"232","country":"Sri Lanka"},{"id":"4","name":"Brian Lara","image":"https:\/\/upload.wikimedia.org\/wikipedia\/commons\/thumb\/0\/0a\/Brian_Lara_stance_swinging_4-19-09.JPG\/220px-Brian_Lara_stance_swinging_4-19-09.JPG","total_score":"22156","description":"Brian Charles Lara, TC, OCC, AM (born 2 May 1969) is a former Trinidadian international cricket player. He is widely acknowledged as one of the greatest cricketers of all-time.He topped the Test batting rankings on several occasions and holds several cricketing records, including the record for the highest individual score in first-class cricket, with 501 not out for Warwickshire against Durham at Edgbaston in 1994, which is the only quintuple hundred in first-class cricket history","matches_played":"261","country":"West Indies"},{"id":"5","name":"Steve Smith","image":"upload.wikimedia.org\/wikipedia\/commons\/thumb\/3\/3f\/Steve_Smith_Cricketer.jpg\/303px-Steve_Smith_Cricketer.jpg","total_score":"8833","description":"Steven Peter Devereux Smith (born 2 June 1989) is an Australian cricketer who represents Australia, New South Wales Blues, and Sydney Sixers. He is currently the captain of the Australia national cricket team across all the three formats.Although he was initially selected for Australia as an all-rounder who could bowl right-arm leg spin, Smith now plays primarily as a batsman. On 25 February 2017 he reached a Test batting rating of 939, the sixth highest of all time.","matches_played":"102","country":"Australia"},{"id":"6","name":"Virender Sehwag","image":"https:\/\/upload.wikimedia.org\/wikipedia\/commons\/thumb\/b\/bb\/Virendra_sehwag_72.jpg\/220px-Virendra_sehwag_72.jpg","total_score":"13459","description":"Virender Sehwag About this sound pronunciation(born 20 October 1978) is a former Indian cricketer, and a former captain of India. Often considered as one of the most destructive batsman of the game, Sehwag is an aggressive right-handed opening batsman and a part-time right-arm off-spin bowler. He played his first One Day International in 1999 and joined the Indian test side in 2001.In April 2009, Sehwag became the only Indian to be honoured as the Wisden Leading Cricketer in the World for his performance in 2008,subsequently becoming the first player of any nationality to retain the award for 2009.","matches_played":"178","country":"India"},{"id":"7","name":"Kapil Dev","image":"https:\/\/upload.wikimedia.org\/wikipedia\/commons\/thumb\/f\/fc\/Kapil_Dev_at_Equation_sports_auction.jpg\/300px-Kapil_Dev_at_Equation_sports_auction.jpg","total_score":"11356","description":"Kapil Dev Ramlal Nikhanj(About this sound pronunciation ; born 6 January 1959), better known as Kapil Dev, is a former Indian cricketer, often considered one of the greatest cricketers of India.He captained the Indian cricket team which won the 1983 Cricket World Cup. Named by Wisden as the Indian Cricketer of the Century in 2002,Kapil Dev is considered as one of the greatest all-rounders of all time. He was also India's national cricket coach for 10 months between October 1999 and August 2000.","matches_played":"275","country":"India"},{"id":"8","name":"Adam Gilchrist","image":"https:\/\/upload.wikimedia.org\/wikipedia\/commons\/thumb\/8\/80\/Adam_Gilchrist_of_Australia.jpg\/220px-Adam_Gilchrist_of_Australia.jpg","total_score":"10334","description":"Adam Craig Gilchrist; born 14 November 1971), nicknamed \"Gilly\" or \"Churchy\", is a former Australian cricketer. He was the captain of Australia, and Middlesex. He is an attacking left-handed batsman and record-breaking wicket-keeper, who redefined the role for the Australia national cricket team through his aggressive batting. He is widely regarded as the greatest wicket-keeper–batsman in the history of the game. He held the world record for the most dismissals by a wicket-keeper in One Day International (ODI) cricket until it was surpassed by Kumar Sangakkara in 2015 and the most by an Australian in Test cricket.","matches_played":"190","country":"Australia"},{"id":"9","name":"Jacques Kallis","image":"https:\/\/upload.wikimedia.org\/wikipedia\/commons\/thumb\/a\/a0\/JAQUES_KALLIS_%283175901786%29.jpg\/252px-JAQUES_KALLIS_%283175901786%29.jpg","total_score":"19695","description":"Jacques Kallis (born 16 October 1975) is a former South African cricketer and the current coach of Kolkata Knight Riders.As a right-handed batsman and right-arm fast-medium swing bowler, Kallis is regarded as one of the greatest cricketers of all time and one of game's greatest all-rounders. As of 2016 he was the only cricketer in the history of the game to score more than 10,000 runs and take 250 wickets in both one-day and Test match cricket.","matches_played":"257","country":"South africa"},{"id":"10","name":"Don Bradman","image":"https:\/\/upload.wikimedia.org\/wikipedia\/commons\/thumb\/4\/42\/DonaldBradman.jpg\/220px-DonaldBradman.jpg","total_score":"28067","description":"Sir Donald George \"Don\" Bradman, AC (27 August 1908 – 25 February 2001), often referred to as \"The Don\", was an Australian cricketer, widely acknowledged as the greatest batsman of all time. Bradman's career Test batting average of 99.94 is often cited as the greatest achievement by any sportsman in any major sport.","matches_played":"234","country":"South africa"},{"id":"11","name":"Shahid Afridi","image":"https:\/\/upload.wikimedia.org\/wikipedia\/commons\/thumb\/4\/48\/Shahid_Afridi_2010-cropped.jpg\/220px-Shahid_Afridi_2010-cropped.jpg","total_score":"5689","description":"He is known for his aggressive batting style and previously held the record for the fastest ODI century in 37 deliveries. He also holds the distinction of having hit the most number of sixes in the history of ODI cricket,.Afridi considers himself a better bowler than batsman, and has taken 48 Test wickets and over 350 in ODIs. Currently Afridi is leading the chart of most T20I wickets with 92 wickets from 92 matches.Afridi currently is the President for PSL team Peshawar Zalmi which is owned by his cousin Javed Afridi.","matches_played":"112","country":"Pakistan"},{"id":"12","name":"Kumar Sangakkara","image":"https:\/\/upload.wikimedia.org\/wikipedia\/commons\/thumb\/b\/bd\/Kumar_Sangakkara_bat_in_hand.JPG\/220px-Kumar_Sangakkara_bat_in_hand.JPG","total_score":"28016","description":"Kumar “Sanga\" Chokshanada Sangakkara; born 27 October 1977) is a former Sri Lankan cricketer and captain of the Sri Lankan national team. Widely regarded as one of the world's most influential cricketers,Sangakkara rated as the Greatest ODI batsman of all time in a recent public poll. Sangakkara has forged many formidable partnerships with long time team mate and friend, Mahela Jayawardene and holds numerous batting records in the modern era across all formats of the game.He is second to Tendulkar in terms of most international runs with 28,016","matches_played":"250","country":"Sri Lanka"},{"id":"13","name":"Chris Gayle","image":"https:\/\/upload.wikimedia.org\/wikipedia\/commons\/thumb\/1\/12\/ChrisGayle_Cropped.jpg\/220px-ChrisGayle_Cropped.jpg","total_score":"13226","description":"Christopher Henry \"Chris\" Gayle (born 21 September 1979) is a Jamaican cricketer who plays international cricket for the West Indies. Considered one of the most powerful batsmen in limited-overs cricket, Gayle has set numerous records in all three formats of cricket.He is one of only four players who have scored two triple centuries at Test level: 317 against South Africa in 2005, and 333 against Sri Lanka in 2010. He is known as a big hitter, very often hitting sixes; in 2012 he became the first player to hit a six off the first ball of a Test match. Playing for Royal Challengers Bangalore, he scored a 30-ball century, that became the highest individual T20 score (175 not out). It eclipsed the previous mark set by Brendon McCullum of Kolkata Knight Riders. At the launch of the Caribbean Premier League he was announced as the first franchise player for the league.","matches_played":"180","country":"West Indies"},{"id":"14","name":"Ricky Ponting","image":"https:\/\/upload.wikimedia.org\/wikipedia\/commons\/thumb\/4\/49\/Ricky_Ponting_2015.jpg\/220px-Ricky_Ponting_2015.jpg","total_score":"24150","description":"Ricky Thomas Ponting, AO (born 19 December 1974), nicknamed Punter, is an Australian former cricketer who was captain of the Australia national cricket team during its 'golden era'; between 2004 and 2011 in Test cricket and 2002 and 2011 in One Day International cricket. He is a specialist right-handed batsman, slips and close catching fielder, as well as a very occasional bowler. Ponting holds the record of being the only cricketer in the history of Test cricket to be a part of 100 Test match wins. He was named \"Cricketer of the decade 2000\". He led Australia to victory at the 2003 and 2007 Cricket World Cups and was also a member of the 1999 World Cup winning team under Steve Waugh.","matches_played":"289","country":"Australia"},{"id":"15","name":"AB de Villiers","image":"https:\/\/upload.wikimedia.org\/wikipedia\/commons\/thumb\/4\/40\/AB_de_Villiers_2.jpg\/220px-AB_de_Villiers_2.jpg","total_score":"10246","description":"Abraham Benjamin de Villiers (born 17 February 1984) is a South African cricketer who currently captains the South African One Day International (ODI) team. He is also a former captain in T20I and Test cricket for South Africa. De Villiers is regarded as one of the greatest cricketers of all time and a legend in the modern cricket world.De Villiers holds many batting records, including world's fastest 50, 100 and 150 in ODI cricket, the fastest Test century by a South African and the fastest T20I 50 by a South African. His match winning ability and lethal innings across all formats rated him as number one batsman in several occasions.","matches_played":"241","country":"South africa"},{"id":"16","name":"Sachin Tendulkar","image":"https:\/\/upload.wikimedia.org\/wikipedia\/commons\/thumb\/2\/25\/Sachin_Tendulkar_at_MRF_Promotion_Event.jpg\/220px-Sachin_Tendulkar_at_MRF_Promotion_Event.jpg","total_score":"21999","description":"Sachin Ramesh Tendulkar; born 24 April 1973) is a former Indian cricketer and captain, widely regarded as one of the greatest batsmen of all time.He took up cricket at the age of eleven, made his Test debut on 15 November 1989 against Pakistan in Karachi at the age of sixteen, and went on to represent Mumbai domestically and India internationally for close to twenty-four years. He is the only player to have scored one hundred international centuries, the first batsman to score a double century in a One Day International, the holder of the record for the number of runs in both ODI and Test cricket, and the only player to complete more than 30,000 runs in international cricket.","matches_played":"551","country":"India"},{"id":"17","name":"Virat Kohli","image":"https:\/\/upload.wikimedia.org\/wikipedia\/commons\/thumb\/e\/e9\/Virat_Kohli_June_2016_%28cropped%29.jpg\/220px-Virat_Kohli_June_2016_%28cropped%29.jpg","total_score":"6458","description":"Virat Kohli (born 5 November 1988) is an Indian international cricketer who currently captains the India national team. A right-handed batsman often regarded as one of the best batsmen in the world,Kohli was ranked eighth in ESPN's list of world's most famous athletes in 2016. He plays for the Royal Challengers Bangalore in the Indian Premier League (IPL), and has been the team's captain since 2013.","matches_played":"85","country":"India"}],"quote_max":"100000","quote_available":"24694"}
